package b_operation;

public class Operation_01 {
	public static void main(String[] args){
	/*	
	1. 연산자 기본
	- 단항연산자
      : ++, --, +, -, ~(틸트), !(not의 의미), (타입)->캐스트연산자
      
	- 이항연산자
	  : 산술연산자=> +, -, *, /, %(나머지 연산자), <<(shift연산자), >>, >>>
	  : 비교연산자=> <, >, <=(작거나 같다), >=(크거나 같다), ==(대입할때 쓰니까 같다는 뜻은 두개), !=(다르다), instanceof(예약어)
	  : 논리연산자=> &(그리고 and), |(or), ^(엑스오어 연산자 exclusive), &&(엔드결합), ||(or결합)
	  
	- 삼항연산자	
	  : 1? 2:3
	  
	- 대입연산자
	  : =, op=(operation)
	  
	    
	2. 연산우선순위
	- 단항> 이항 > 삼항 (단항부터)
	- 산술> 비교> 논리> 대입   (산술연산이 가장 빠르고 비교 그다음 논리 그다음 대입)
	
		
		
		
		
		
		
		
	*/	
	}
}
